STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/Zigbee/Zigbee_OnOff_Server_Coord_ThreadX/STM32_WPAN/App/app_zigbee.c
  stBasicServerDefaults.model_name[0] = sizeof( APP_ZIGBEE_CHIP_NAME );
  memcpy( &stBasicServerDefaults.model_name[1], APP_ZIGBEE_CHIP_NAME, sizeof( APP_ZIGBEE_CHIP_NAME ) );

  stBasicServerDefaults.date_code[0] = sizeof( APP_ZIGBEE_APP_DATE_CODE );
  memcpy( &stBasicServerDefaults.date_code[1], APP_ZIGBEE_APP_DATE_CODE, sizeof( APP_ZIGBEE_APP_DATE_CODE ) );

  stBasicServerDefaults.sw_build_id[0] = sizeof( APP_ZIGBEE_APP_BUILD_ID );
  memcpy( &stBasicServerDefaults.sw_build_id[1], APP_ZIGBEE_APP_BUILD_ID, sizeof( APP_ZIGBEE_APP_BUILD_ID ) );

  /* Version are on 8 bits : 3 bits for Major version and 5 bits for Minor version */
  stBasicServerDefaults.app_version = (uint8_t)( ( APP_ZIGBEE_APP_VERSION & 0x70u ) << 1u ) | ( APP_ZIGBEE_APP_VERSION & 0x0Fu );
  stBasicServerDefaults.stack_version = (uint8_t)( ( APP_ZIGBEE_STACK_VERSION & 0x70u ) << 1u ) | ( APP_ZIGBEE_STACK_VERSION & 0x0Fu );
  stBasicServerDefaults.hw_version = (uint8_t)( ( APP_ZIGBEE_CHIP_VERSION & 0x70u ) << 1u ) | ( APP_ZIGBEE_CHIP_VERSION & 0x0Fu );

  stBasicServerDefaults.power_source = APP_ZIGBEE_BOARD_POWER;

  /* Configure default Basic Server */
  ZbZclBasicServerConfigDefaults( stZigbeeAppInfo.pstZigbee , &stBasicServerDefaults );
}

/**
 * @brief  Initialize Zigbee stack layers
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_StackLayersInit( void )
{
  LOG_INFO_APP( "StackLayers Init (startupMode = %d)", stZigbeeAppInfo.eStartupControl );

  /* Initialise Zigbee */
  stZigbeeAppInfo.pstZigbee = ZbInit( 0U, NULL, NULL );
  assert(stZigbeeAppInfo.pstZigbee != NULL);

  /* Configure Zigbee Logging with log Error/Warning/Info/Debug */
  ZbSetLogging( stZigbeeAppInfo.pstZigbee, ZIGBEE_CONFIG_LOG_LEVEL, APP_ZIGBEE_Printf );

  /* Configure Application Basic Server */
  APP_ZIGBEE_ConfigBasicServer();

  /* Create the endpoint and cluster(s) */
  APP_ZIGBEE_ConfigEndpoints();

  /* USER CODE BEGIN APP_ZIGBEE_StackLayersInit1 */
  /* All Led Off at startup */
  APP_LED_OFF(LED_RED);
  APP_LED_OFF(LED_GREEN);
  APP_LED_OFF(LED_BLUE);

  /* USER CODE END APP_ZIGBEE_StackLayersInit1 */

  /* Configure the joining parameters */
  stZigbeeAppInfo.eJoinStatus = (enum ZbStatusCodeT) 0x01;  /* init to error status */
  stZigbeeAppInfo.lJoinDelay = HAL_GetTick();               /* now */

  /* Initialization Complete */
  stZigbeeAppInfo.bHasInit = true;

  /* Print Application information */
  APP_ZIGBEE_PrintApplicationInfo();

  if ( stZigbeeAppInfo.bPersistNotification != false )
    { APP_ZIGBEE_PersistenceStartup(); }

  if ( stZigbeeAppInfo.bNwkStartup != false )
  {
    /* Create the NwkFormOrJoin Task */
    APP_ZIGBEE_NwkFormOrJoinTaskInit();
  }
  else
  {
    /* Start directly Zigbee Application */
    /* USER CODE BEGIN APP_ZIGBEE_StackLayersInit2 */
    APP_LED_OFF(LED_BLUE);

    /* USER CODE END APP_ZIGBEE_StackLayersInit2 */
    APP_ZIGBEE_ConfigMeshNetwork();
    APP_ZIGBEE_ApplicationStart();
  }
}

/**
  * @brief  Callback triggered when the Timer between two Join tentative expire
  * @param  arg : Not used
  * @retval None
  */
static void APP_ZIGBEE_NwkFormWaitElapsed( void * arg )
{
  UNUSED( arg );

  LOG_INFO_APP( "Waiting time between two 'Join' tentatives Elapsed." );

  /* Stop Timer that can advertise user during 'Join' waiting time */
  if ( stZigbeeAppInfo.eStartupControl == ZbStartTypeJoin )
  {
    UTIL_TIMER_Stop( &stNwkFormWaitJoinTimer );
  }

  tx_semaphore_put( &NwkFormWaitEndSemaphore );
}

/**
  * @brief  Callback triggered when the 'Join Wait' Timer expire
  * @param  arg : Not used
  * @retval None
  */
static void APP_ZIGBEE_NwkFormWaitJoinElapsed( void  * arg )
{
  UNUSED( arg );

  if ( stZigbeeAppInfo.eJoinStatus != ZB_STATUS_SUCCESS )
  {
    /* USER CODE BEGIN APP_ZIGBEE_NwkFormWaitJoinElapsed */
    /* Blinck Led to indicate to user that a Join is 'On Going' */
    APP_LED_TOGGLE( LED_BLUE );

    /* USER CODE END APP_ZIGBEE_NwkFormWaitJoinElapsed */
  }
  else
  {
    UTIL_TIMER_Stop( &stNwkFormWaitJoinTimer );
    /* USER CODE BEGIN APP_ZIGBEE_NwkFormWaitJoinElapsed_2 */
    APP_LED_OFF( LED_BLUE );

    /* USER CODE END APP_ZIGBEE_NwkFormWaitJoinElapsed_2 */
  }
}

/**
 * @brief  Handle Zigbee network forming and joining
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_NwkFormOrJoin(void)
{
  struct ZbStartupT   stConfig;

  if ( stZigbeeAppInfo.eJoinStatus != ZB_STATUS_SUCCESS )
  {
    /* Application configure Startup */
    APP_ZIGBEE_GetStartupConfig( &stConfig );

    /* Using ZbStartupWait (blocking) */
    stZigbeeAppInfo.eJoinStatus = ZbStartupWait( stZigbeeAppInfo.pstZigbee, &stConfig );

    if ( stZigbeeAppInfo.eJoinStatus == ZB_STATUS_SUCCESS )
    {
      stZigbeeAppInfo.lJoinDelay = 0u;
      stZigbeeAppInfo.bInitAfterJoin = true;

      /* USER CODE BEGIN APP_ZIGBEE_NwkFormOrJoin */
      APP_LED_ON( LED_BLUE );

      /* USER CODE END APP_ZIGBEE_NwkFormOrJoin */
      if ( stZigbeeAppInfo.eStartupControl == ZbStartTypeForm )
        { LOG_INFO_APP( "Mesh network created." ); }
      else
        { LOG_INFO_APP( "Association accepted." ); }
    }
    else
    {
      LOG_INFO_APP( "Startup Wait Callback Status : 0x%02X", stZigbeeAppInfo.eJoinStatus );
      LOG_INFO_APP( "Startup failed, attempting again after a short delay (%d ms)", APP_ZIGBEE_STARTUP_FAIL_DELAY );

      if ( stZigbeeAppInfo.eStartupControl == ZbStartTypeJoin )
      {
        /* Reset ZigBee data to be sure that start with good data */
        ZbReset( stZigbeeAppInfo.pstZigbee );
      }

      stZigbeeAppInfo.lJoinDelay = HAL_GetTick() + APP_ZIGBEE_STARTUP_FAIL_DELAY;
    }
  }

  /* If Network forming/joining was not successful reschedule the current task to retry the process */
  if ( stZigbeeAppInfo.eJoinStatus != ZB_STATUS_SUCCESS )
  {
    tx_semaphore_put( &NwkFormStartSemaphore );
  }
  else
  {
    APP_ZIGBEE_ConfigMeshNetwork();
    APP_ZIGBEE_ApplicationStart();
  }
}

/**
 * @brief  Handle Zigbee network forming and joining task for ThreadX
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_NwkFormOrJoinTask( ULONG lArgument )
{
  UNUSED( lArgument );

  for(;;)
  {
    tx_semaphore_get( &NwkFormStartSemaphore, TX_WAIT_FOREVER );

    if ( stZigbeeAppInfo.eJoinStatus != ZB_STATUS_SUCCESS )
    {
      UTIL_TIMER_Start( &stNwkFormWaitTimer );
      tx_semaphore_get( &NwkFormWaitEndSemaphore, TX_WAIT_FOREVER );
    }

    APP_ZIGBEE_NwkFormOrJoin();
  }
}

/**
 * @brief  Handle Zigbee network forming and joining
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ConfigMeshNetwork(void)
{
  bool      bReturn;
  uint32_t  lBroadcastTimeOut = 3;

  stZigbeeAppInfo.bInitAfterJoin = false;

  /* Assign ourselves to the group addresses */
  bReturn = APP_ZIGBEE_ConfigGroupAddr();

  /* If we're using group addressing (broadcast), shorten the broadcast timeout */
  if ( bReturn != false )
  {
    ZbNwkSet( stZigbeeAppInfo.pstZigbee, ZB_NWK_NIB_ID_NetworkBroadcastDeliveryTime, &lBroadcastTimeOut, sizeof( lBroadcastTimeOut ) );
  }

  /* If Coord or Router, start the possibility to know where a 'Device' (End Device ou Router) Join the Network */
  if ( stZigbeeAppInfo.eStartupControl == ZbStartTypeForm )
  {
    ZbMsgFilterRegister( stZigbeeAppInfo.pstZigbee, ZB_MSG_FILTER_JOIN_IND, ZB_MSG_DEFAULT_PRIO, APP_ZIGBEE_DeviceJointCallback, NULL );
  }
}

/**
 * @brief  Handle Zigbee network forming and joining
 * @param  eZbStatus :
 * @param  pCallBackArg :
 * @retval None
 */
static void ZbStartupWaitCallback( enum ZbStatusCodeT eZbStatus, void * pCallBackArg )
{
  eZbStartupWaitStatus = eZbStatus;

  tx_semaphore_put( &StartupWaitEndSemaphore );
}

/**
 * @brief ZbStartupWait
 * @param  zb : Zigbee stack handler
 * @param  config : Configuration parameter used to form or join the network
 * @retval None
 */
static enum ZbStatusCodeT ZbStartupWait( struct ZigBeeT * pstZigbee, struct ZbStartupT * pstConfig )
{
  enum ZbStatusCodeT  eZbStatus;

  /* Variable also used by ZbStartupWaitCallback */
  eZbStartupWaitStatus = ZB_STATUS_SUCCESS;

