STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/Zigbee/Zigbee_OnOff_Server_Coord_ThreadX/STM32_WPAN/App/app_zigbee.c
  /* Start & Timer to can advertise user during 'Join' waiting time */
  if ( stZigbeeAppInfo.eStartupControl == ZbStartTypeJoin )
  {
    UTIL_TIMER_Start( &stNwkFormWaitJoinTimer );
  }

  eZbStatus = ZbStartup( pstZigbee, pstConfig, ZbStartupWaitCallback, NULL );
  if ( eZbStatus != ZB_STATUS_SUCCESS )
  {
    return eZbStatus;
  }

  /* Wait ZB Join finished */
  tx_semaphore_get( &StartupWaitEndSemaphore, TX_WAIT_FOREVER );

  /* Stop Timer that can advertise user during 'Join' waiting time */
  if ( stZigbeeAppInfo.eStartupControl == ZbStartTypeJoin )
  {
    UTIL_TIMER_Stop( &stNwkFormWaitJoinTimer );
    /* USER CODE BEGIN ZbStartupWait */
    APP_LED_OFF( LED_BLUE );

    /* USER CODE END ZbStartupWait */
  }

  return eZbStartupWaitStatus;
}

/**
 * @brief Callback called every time a new Device (Router ou EndDevice) join the Network.
 *        Information around the Device (Address & Capability) are sent on 'APP_ZIGBEE_NewDevice()' function.
 * @param zb        Zigbee stack handler
 * @param lId       Type of filter Message
 * @param pMessage  Pointer on Message information
 * @param arg       Pointer on User Argument.
 */
static enum zb_msg_filter_rc APP_ZIGBEE_DeviceJointCallback( struct ZigBeeT * zb, uint32_t lId, void * pMessage, void * arg )
{
  struct ZbNlmeJoinIndT * pstJoinMessage;

  if ( lId == ZB_MSG_FILTER_JOIN_IND )
  {
    pstJoinMessage = ( struct ZbNlmeJoinIndT * )pMessage;

    switch ( pstJoinMessage->rejoinNetwork )
    {
      case ZB_NWK_REJOIN_TYPE_ASSOC :
      case ZB_NWK_REJOIN_TYPE_ORPHAN :
      case ZB_NWK_REJOIN_TYPE_NWKREJOIN :
      case ZB_NWK_REJOIN_TYPE_NWKCOMMISS_JOIN :
      case ZB_NWK_REJOIN_TYPE_NWKCOMMISS_REJOIN :
          /* A new Device has Join Network at MAC/NWK level */
          APP_ZIGBEE_SetNewDevice( pstJoinMessage->nwkAddr, pstJoinMessage->extAddr, pstJoinMessage->capabilityInfo );
          break;

      default :
          break;
    }
  }

  return( ZB_MSG_CONTINUE );
}

/*************************************************************
 *
 * GENERIC FUNCTIONS
 *
 *************************************************************/

/**
 * @brief  Callback that indicate if a 'Permit to Join' the network can be done
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ZbZdoPermitJoinReqCallback( struct ZbZdoPermitJoinRspT * pstJoinResponse, void * arg )
{
  UNUSED( arg );

  if ( pstJoinResponse->status != ZB_STATUS_SUCCESS )
  {
    LOG_ERROR_APP( "Error, cannot set Permit Join duration (%d)", pstJoinResponse->status );
  }
  else
  {
    LOG_INFO_APP( "Permit Join duration successfully changed." );
  }
}

/**
 * @brief  Send the request to NWK layer a Permit to Join the network
 * @param  cPermitJoinDelay   Delay in second during the new Permit to Join is available
 * @retval None
 */
void APP_ZIGBEE_PermitJoin( uint8_t cPermitJoinDelay )
{
  struct ZbZdoPermitJoinReqT  stJoinRequest;
  enum ZbStatusCodeT          eStatus;

  memset( &stJoinRequest, 0, sizeof( stJoinRequest ) );
  stJoinRequest.destAddr = ZB_NWK_ADDR_UNDEFINED;
  stJoinRequest.tcSignificance = true;
  stJoinRequest.duration = cPermitJoinDelay;

  LOG_INFO_APP( "Send command Permit Join during %ds", cPermitJoinDelay );
  eStatus = ZbZdoPermitJoinReq( stZigbeeAppInfo.pstZigbee, &stJoinRequest, APP_ZIGBEE_ZbZdoPermitJoinReqCallback, NULL);
  if ( eStatus != ZB_STATUS_SUCCESS )
  {
    LOG_ERROR_APP( "Error during command Permit Join (%d)", eStatus );
  }
}

/**
 * @brief  Indicate if Application as already join the network
 * @param  None
 * @retval True if Join OK, else False
 */
bool APP_ZIGBEE_IsAppliJoinNetwork( void )
{
  bool                bJoinOk = false;
  uint64_t            dlEpid = 0U;
  enum ZbStatusCodeT  eZbStatus;

  if ( stZigbeeAppInfo.pstZigbee != NULL )
  {
    /* Check if the router joined the network, and if the waiting time after the Join is finished */
    eZbStatus = ZbNwkGet( stZigbeeAppInfo.pstZigbee, ZB_NWK_NIB_ID_ExtendedPanId, &dlEpid, sizeof( dlEpid ) );
    if ( ( eZbStatus == ZB_STATUS_SUCCESS) && ( dlEpid != 0u ) && ( stZigbeeAppInfo.eJoinStatus == ZB_STATUS_SUCCESS ) )
      { bJoinOk = true; }
  }

  return( bJoinOk );
}

/**
 * @brief   Indicate a Device with Install Code request a Join.
 *          Add the LinkKey (from Install Code) on List and start a Join during 30s.
 *
 * @param   dlExtendedAddress   Device Extended Address
 * @param   szInstallCode       Device Install Code
 * @param   cPermitJoinDelay    Time to Device to Join network. If 0, PermitJoin is not called.
 */
void APP_ZIGBEE_AddDeviceWithInstallCode( uint64_t dlExtendedAddress, uint8_t * szInstallCode, uint8_t cPermitJoinDelay )
{
  uint32_t                  lTcPolicy = 0;
  struct ZbApsmeAddKeyReqT  stAddKeyReq;
  struct ZbApsmeAddKeyConfT stAddKeyConf;
  static  bool              bTrustCenterDone = false;

  if ( bTrustCenterDone == false )
  {
    ZbApsGet( stZigbeeAppInfo.pstZigbee, ZB_APS_IB_ID_TRUST_CENTER_POLICY, &lTcPolicy, sizeof(lTcPolicy));
    lTcPolicy |= (ZB_APSME_POLICY_IC_SUPPORTED | ZB_APSME_POLICY_TCLK_UPDATE_REQUIRED | ZB_APSME_POLICY_TC_POLICY_CHANGE);

    ZbApsSet( stZigbeeAppInfo.pstZigbee, ZB_APS_IB_ID_TRUST_CENTER_POLICY, &lTcPolicy, sizeof(lTcPolicy) );
    bTrustCenterDone = true;
  }

  /* Register 'Application Link Key' for the Device */
  memset( &stAddKeyConf, 0, sizeof( stAddKeyConf ) );
  memset( &stAddKeyReq, 0, sizeof( stAddKeyReq ) );

  stAddKeyReq.keyType = ZB_SEC_KEYTYPE_TC_LINK;
  stAddKeyReq.keySeqNumber = 0;
  stAddKeyReq.partnerAddr = dlExtendedAddress;

  /*Extract Link Key from the Install Code*/
  ZbAesMmoHash( szInstallCode, ( ZB_SEC_KEYSIZE + 2u ), stAddKeyReq.key );

  /* Add the new Link Key */
  ZbApsmeAddKeyReq( stZigbeeAppInfo.pstZigbee, &stAddKeyReq, &stAddKeyConf );
  if ( stAddKeyConf.status != ZB_STATUS_SUCCESS )
  {
    LOG_ERROR_APP( "Error Add Link Key (0x%02X)", stAddKeyConf.status );
  }
  else
  {
    LOG_INFO_APP( "Add of Device Link Key OK." );
    if ( cPermitJoinDelay != 0 )
    {
      APP_ZIGBEE_PermitJoin( cPermitJoinDelay );
      LOG_INFO_APP( "Device can now Join Network during %d seconds.", cPermitJoinDelay );
    }
  }
}

/**
 * @brief  Get the current RF channel
 * @param  cCurrentChannel    Current Channel
 * @retval True if Ok, else false.
 */
bool APP_ZIGBEE_GetCurrentChannel( uint8_t * cCurrentChannel )
{
  bool      bResult = false;
  uint8_t   cChannel = 0 ;
  uint32_t  lChannelmask;
  struct ZbNlmeGetInterfaceReqT   stZbNlmeRequest;
  struct ZbNlmeGetInterfaceConfT  stZbNlmeConfig;

  /* Verify if Appli has already Join a Network  */
  if ( APP_ZIGBEE_IsAppliJoinNetwork() != false )
  {
    /* NLME-GET-INTERFACE.request on Interface 0 */
    memset( &stZbNlmeRequest, 0, sizeof( stZbNlmeRequest ) );
    memset( &stZbNlmeConfig, 0, sizeof( stZbNlmeConfig ) );

    stZbNlmeRequest.ifcIndex = 0;

    ZbNlmeGetInterface( stZigbeeAppInfo.pstZigbee, &stZbNlmeRequest, &stZbNlmeConfig);
    if ( stZbNlmeConfig.status == ZB_STATUS_SUCCESS )
    {
      /* Current channel */
      lChannelmask = stZbNlmeConfig.channelInUse;
      while ( ( lChannelmask & 1u ) == 0u )
      {
        /* Iterate through bits until we find the only set bit */
        lChannelmask = lChannelmask >> 1u;
        cChannel++;
      }

