STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/Zigbee/Zigbee_OnOff_Server_Coord_ThreadX/STM32_WPAN/App/app_zigbee.c
      *cCurrentChannel = cChannel;
      bResult = true;
    }
  }

  return( bResult );
}

/**
 * @brief  Set the current RF TX Power
 * @param  cTxPower    Transmit Power to set
 * @retval True if Ok, else false.
 */
bool APP_ZIGBEE_SetTxPower( uint8_t cTxPower )
{
  return ZbNwkIfSetTxPower( stZigbeeAppInfo.pstZigbee, "wpan0", cTxPower );
}

/**
 * @brief Display a Security Key or Install Code
 *
 * @param szCode  Code to display
 * @return        String of the Code
 */
char * APP_ZIGBEE_GetDisplaySecKey( const uint8_t * szCode, uint16_t iLength, bool bSpace )
{
  uint16_t      iIndex;
  static char   szCodeValue[( ( ZB_SEC_KEYSIZE + 2u ) * 3u ) + 1u];

  /* Initialize & verify parameters */
  memset( szCodeValue, 0, sizeof(szCodeValue) );
  if ( iLength > ( ZB_SEC_KEYSIZE + 2u ) )
  {
    iLength = ( ZB_SEC_KEYSIZE + 2u );
  }

  for ( iIndex= 0; iIndex < iLength; iIndex++ )
  {
    if ( bSpace != false )
    {
      snprintf( &szCodeValue[iIndex * 3u], ( sizeof(szCodeValue) - ( iIndex * 3u ) ), "%02X ", szCode[iIndex] );
    }
    else
    {
      snprintf( &szCodeValue[iIndex * 2u], ( sizeof(szCodeValue) - ( iIndex * 2u ) ), "%02X", szCode[iIndex] );
    }
  }

  return (char *)&szCodeValue;
}

/**
 * @brief  Print standard application information (channel in use, etc..) common to all Zigbee Application
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_PrintGenericInfo( void )
{
  /* Display Application Version. */
  LOG_INFO_APP( "Application Version : %d.%d", ( APP_ZIGBEE_APP_VERSION >> 4u ), ( APP_ZIGBEE_APP_VERSION & 0x0F ) );

  /* Display Zigbee Stack Info */
#if ( CONFIG_ZB_ZCL_SE == 1 )
  LOG_INFO_APP( "Zigbee Stack version : R%02d 'Smart Energy'", CONFIG_ZB_REV );
#else // ( CONFIG_ZB_ZCL_SE == 1 )
  LOG_INFO_APP( "Zigbee Stack version : R%02d", CONFIG_ZB_REV );
#endif // ( CONFIG_ZB_ZCL_SE == 1 )

  LOG_INFO_APP( "Zigbee Extended Address : " LOG_DISPLAY64(), LOG_NUMBER64( ZbExtendedAddress( stZigbeeAppInfo.pstZigbee ) ) );

  /* Display Link Key */
  LOG_INFO_APP( "Link Key : %s", APP_ZIGBEE_GetDisplaySecKey( sec_key_ha, ZB_SEC_KEYSIZE, true ) );
}

/**
 * @brief  Send the Trace from Low-Level ZigBee stack
 * @param  pstZigbee      Pointer on ZigBee Structure.
 * @param  lMask          Trace Level Mask.
 * @param  pFunctionName  Function name.
 * @param  pData          Trace message.
 * @param  pArgList       Pointer on Trace arguments list.
 * @retval None
 */
static void APP_ZIGBEE_Printf( struct ZigBeeT * pstZigbee, uint32_t lMask, const char * pFunctionName, const char * pData, va_list pArgList )
{
#if (CFG_LOG_SUPPORTED != 0)
  if ( ( lMask & ZIGBEE_CONFIG_LOG_LEVEL ) != 0u )
  {
    Log_Module_PrintWithArg( LOG_VERBOSE_INFO, LOG_REGION_ZIGBEE, pData, pArgList );
  }
#endif /* (CFG_LOG_SUPPORTED != 0) */
}

/**
 * @brief  Trace the error or the warning reported.
 * @param  ErrId :
 * @param  ErrCode
 * @retval None
 */
void APP_ZIGBEE_Error( uint32_t ErrId, uint32_t ErrCode )
{
  switch ( ErrId )
  {
    default:
        APP_ZIGBEE_TraceError( "ERROR Unknown", 0 );
        break;
  }
}

/**
 * @brief  Warn the user that an error has occurred.
 *
 * @param  pMess  : Message associated to the error.
 * @param  ErrCode: Error code associated to the module (Zigbee or other module if any)
 * @retval None
 */
static void APP_ZIGBEE_TraceError( const char * pMess, uint32_t ErrCode )
{
  LOG_ERROR_APP( "**** Fatal error = %s (Err = 0x%02X) ****", pMess, ErrCode );

  // Intentional INFINITE_LOOP
  // coverity[no_escape]
  while (1U == 1U)
  {
    /* USER CODE BEGIN APP_ZIGBEE_TraceError */
    APP_LED_TOGGLE( LED_BLUE );
    HAL_Delay( 500U );
    APP_LED_TOGGLE( LED_GREEN );
    HAL_Delay( 500U );
    APP_LED_TOGGLE( LED_RED );
    HAL_Delay( 500U );

    /* USER CODE END APP_ZIGBEE_TraceError */
  }
}

